## Plan Result (main)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/12448574275)



<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.oci_compute_instance-2024.oci_core_instance.this



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.oci_compute_instance-2024.oci_core_instance.this will be created
  + resource "oci_core_instance" "this" {
      + availability_domain                 = "kbTA:AP-TOKYO-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "oci_compute_instance-2024-1"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = "FAULT-DOMAIN-1"
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAAEAQDAR5lLWfcv3R351aosBQo/SDAN+VEXYrrxedgGBBJSwaYFKJ1/IX/+dXKUL+NPPL56MJtFSzLCBIsJj5dMzahGHvCtbo5JIpOPKGagHpAo4e7JvSFRUV1jMvW6TI6S09xch8cNNMK32tPVhptV9L9J63XZz3WnH9ApW7jZiBlboOzC2sYLBfcIMVW1a4Sp5CN0ACrjOv//xx4gNHX6QCYCF19xlAeosRSqGrI/av8pohOMCSF7XI6U60YaDsRLPNrzMEParcad7ZygVpMI1SmP39U+7aCbHZJF7rMpckJVKH7tjZsZXOjl0AGXQDURptHsPOg9tWDZpflzYZRDT9juYIZc86jtE38ySsBos4jPWkTuz8ltSkqyeDOyvjExj9dC4i0RT/rgLgKmOQwvQrTfJ4LdLFV846ThACW6c8CISazBorskju7xF1bAKTGfhm3duV90xiuPl+XZpaf3JXaafvqCGX9hJ4GnRx6Xcu930PwN5jEPWgx1y/gpWPFBJQkNKaVpt8d2Tdzgubl1g9zY0w5Sta4/XhyZKBwZpJsMl92bghvd+WGDu0+q/6od7SC9ZPFZEpZWuE42Voswhi0AB2v+BqY8vQ2fxZA1faN6VpZQddetPOVqqwvmcGiD4USlqBadJK6AE1pGbUcfQqnmY/clGW76ZXMzOHnPzTXfAO9S+q9PtRmBB7JvbkzORAjiYwcYy+2DEwfedue+gPhRCSp0kcANESJxTwG3NN2PrUQ31Ttc1Yce5GqukTmVTN+iLAeU8cfZD2YNa5Kh6dwRN2Ej96SX6SpHzS5P/kULoNxATSooUA2pOJseH2vLcPWZw3fu5NXPypJ9HOkm6owYUINgInh1li08O2bphQgwiHfqn3VINKjWYYde8FQXEm1PX1vzlHGbuukIA26Pjh+IVAm7PgLTUpCle09m2aFOvzcdPfYHCg5p//SFTjssrRqnXJEbfppBTKXh39JNquoXI+1Yavzk6rt4Lsq7va+WrAzNlAa5l5fAoyrcSHeZT1w2mK/KO8AaZvMTclgyVov4fsMgvnpO6eWGlJM8qjllHY268UslFurck9RFMlI1dbEabn5zfJkyHj+o297m5BxTmOlg/J2JBg5zwPAh2dIJklL7uHu5ENi/dXd8gHVS48VyP0TcWmhAHDJtwMlw6mPIZp7kgi69WgcAb1RYEWOY1OxclZgJxb9v/fDiLQvLXCjKlB/05oUEmy3ZoHU5ah8CoLr14UKyYWOFzJhQKz/whFinl5xvw8XCf3wsw8zKa6qj30Oc9UfQNDkQa/HaJZTric7Utvx1mgXzm8rNDDGC63WE/ZZoG/bP3fojwP6r4wmNb1D79cwNHybrmD8V3PjL shionichikawa@ShionnoMacBook-Pro.local"
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config (known after apply)

      + availability_config (known after apply)

      + create_vnic_details {
          + assign_ipv6ip             = (known after apply)
          + assign_private_dns_record = true
          + assign_public_ip          = "true"
          + defined_tags              = (known after apply)
          + display_name              = (known after apply)
          + freeform_tags             = (known after apply)
          + hostname_label            = (known after apply)
          + nsg_ids                   = (known after apply)
          + private_ip                = "10.0.0.20"
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = (known after apply)
          + subnet_id                 = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq"
          + vlan_id                   = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options (known after apply)

      + launch_options (known after apply)

      + launch_volume_attachments (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 6
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on ../../modules/main/compute/output.tf line 17, in output "instance_dns_name":
│   17:   value       = oci_core_instance.this.hostname_label
│ 
│ The attribute "hostname_label" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and one more similar warning elsewhere)
╵
```

</details>





## :warning: Warnings :warning:

```hcl
Warning: Deprecated attribute
 
   on ../../modules/main/compute/output.tf line 17, in output "instance_dns_name":
   17:   value       = oci_core_instance.this.hostname_label
 
 The attribute "hostname_label" is deprecated. Refer to the provider
 documentation for details.
 
 (and one more similar warning elsewhere)
```






<!-- github-comment: {"Command":"plan","JobName":"run-terragrunt-plan","PRNumber":30,"Program":"tfcmt","SHA1":"b271d20ab788a34d16d75defe7b9e737bbb8a707","Target":"main","Vars":{},"WorkflowName":"Run Plan on OCI"} -->